# Сакура выписывает в тетрадь числа от 1 до n включительно
# и считает их сумму.
# Помогите Сакуре,
# напишите программу, которая выведет целое число
# - сумму целых чисел от 1 до n
n = int(input())
# print(int(n * (n + 1) / 2))
print(n * (n + 1) // 2)
