# Напишите программу, которая считает строку s и выведет ее копию, в которой все буквы ё будут заменены на е.
#
# Заменить нужно букву ё в обоих регистрах (букву Ё нужно заменить на букву Е).

print(input().replace('ё', 'е').replace('Ё', 'Е'))
