# Закомментируй этот код, который написала Сакура
# для решения этой задачи (решение, как ни странно, не заработало).
# Используй для этого многострочный комментарий.
# (Этот кусок кода нам не нужен, преврати его в многострочный комментарий)
'''print('"') # выводит "
print('H') # выводит H
print('e') # выводит e
print('l') # выводит l
print('l') # выводит l
print('o') # выводит o

print(' ') # выводит пробел

print('w') # выводит w
print('o') # выводит o
print('r') # выводит r
print('l') # выводит l
print('d') # выводит d
print('"') # выводит "'''
