# Напишите программу,
# которая считает строку,
# и выведет False,
# если строка пустая,
# и True иначе
a = str(input())
if a == "":
    print(False)
else:
    print(True)
