# Напиши программу,
# которая считает координаты шахматного короля
# и координаты произвольной клетки на шахматной доске,
# и выведет "YES" (без кавычек) если король может походить на эту клетку,
# и "NO" (без кавычек) в противном случае.
# Король ходит на соседнюю по вертикали, горизонтали или диагонали клетку.
# На первых двух строчках вводятся координаты короля,
# на третьей и четвертой строчке вводятся координаты клетки доски.
# Все координаты - целые числа от 1 до 8 включительно
# нумерация начинается из левого верхнего угла
# вначале вводится вертикальная составляющая координаты,
# потом горизонтальная
a = 1
b = 1
c = 2
d = 2
